In [1]:
import pandas as pd

In [3]:
ser = pd.Series([100,'foo', 200, 300], ['one', 'two', 'three', 'four'])

In [4]:
ser

one      100
two      foo
three    200
four     300
dtype: object

In [5]:
ser.index

Index(['one', 'two', 'three', 'four'], dtype='object')

In [10]:
ser.loc['three']

200

In [16]:
ser.loc[['one', 'two']]

one    100
two    foo
dtype: object

In [19]:
ser[[3, 1, 2]]

four     300
two      foo
three    200
dtype: object

In [20]:
ser.iloc[2]

200

In [25]:
# check by index
'two' in ser

True

In [28]:
print(ser)
print('----')
print(ser * 2)

one      100
two      foo
three    200
four     300
dtype: object
----
one         200
two      foofoo
three       400
four        600
dtype: object

In [29]:
ser[[0,2,3]] ** 2

one      10000
three    40000
four     90000
dtype: object

In [32]:
d = {'set1': pd.Series([1,2,3], index = ['apple', 'banana', 'orange']),
     'set2': pd.Series([1,2,3,4,5], index = ['apple', 'banana', 'pineapple', 'melon', 'orange'])}

In [33]:
df = pd.DataFrame(d)

In [34]:
df.index

Index(['apple', 'banana', 'melon', 'orange', 'pineapple'], dtype='object')

In [35]:
df

           set1  set2
apple       1.0     1
banana      2.0     2
melon       NaN     4
orange      3.0     5
pineapple   NaN     3

In [36]:
df.columns

Index(['set1', 'set2'], dtype='object')

In [37]:
pd.DataFrame(d, index = ['apple', 'banana'], columns = ['set2', 'set3'])

        set2 set3
apple      1  NaN
banana     2  NaN

In [39]:
data = [{'alex': 1, 'alice': 2}, {'ema': 3, 'dora': 4, 'alice': 5}]

In [40]:
pd.DataFrame(data)

   alex  alice  ema  dora
0   1.0      2  NaN   NaN
1   NaN      5  3.0   4.0

In [41]:
pd.DataFrame(data, index = ['Orange', "Apple"])

        alex  alice  ema  dora
Orange   1.0      2  NaN   NaN
Apple    NaN      5  3.0   4.0

In [43]:
df["set3"] = df['set1'] * df['set2']

In [44]:
df

           set1  set2  set3
apple       1.0     1   1.0
banana      2.0     2   4.0
melon       NaN     4   NaN
orange      3.0     5  15.0
pineapple   NaN     3   NaN

In [47]:
df['flag'] = df['set1'] > 2

In [48]:
df

           set1  set2  set3   flag
apple       1.0     1   1.0  False
banana      2.0     2   4.0  False
melon       NaN     4   NaN  False
orange      3.0     5  15.0   True
pineapple   NaN     3   NaN  False

In [49]:
df.pop('set3')

apple         1.0
banana        4.0
melon         NaN
orange       15.0
pineapple     NaN
Name: set3, dtype: float64

In [50]:
df

           set1  set2   flag
apple       1.0     1  False
banana      2.0     2  False
melon       NaN     4  False
orange      3.0     5   True
pineapple   NaN     3  False

In [51]:
del df['set2']

df

           set1   flag
apple       1.0  False
banana      2.0  False
melon       NaN  False
orange      3.0   True
pineapple   NaN  False

In [56]:
df.insert(1, 'copy_of_one', df['set1'])

df

           set1  copy_of_one1   flag  copy_of_one
apple       1.0           1.0  False          1.0
banana      2.0           2.0  False          2.0
melon       NaN           NaN  False          NaN
orange      3.0           3.0   True          3.0
pineapple   NaN           NaN  False          NaN